Cannot make surface with specified boundary.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SiteCannotDrawSurfaceBoundary { get; }
  Visual Basic
Public Shared ReadOnly Property SiteCannotDrawSurfaceBoundary As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SiteCannotDrawSurfaceBoundary {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace